; This file was generated from AtomSampleViewer\Shaders\OptimizationTests\DummyTransformColor.azsl using these commands:
; "e:\Lumberyard\branches\Atom\Bin64vc141.Debug\Builders\AZSLc\1.6\azslc.exe" DummyTransformColor.azsl --use-spaces --namespace=dx --W1 --inline-const=128 -o DummyTransformColor.azslin.dx12.azslcout
; "e:\Lumberyard\branches\Atom\Bin64vc141.Debug\Builders\DirectXShaderCompilerAz\dxc.exe" -E MainPS -T ps_6_2  -WX -Zpr -Zi -Zsb -enable-16bit-types -Fo DummyTransformColor.dx12.MainPS.dxil -Fh DummyTransformColor.MainPS.dx12.dxil.txt DummyTransformColor.azslin.dx12.azslcout
;
; Some additional (nonsense) lines are added below for the sake of testing, marked with FOR_UNIT_TEST

#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; UV                       0   xy          1     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 9c56aab5f5cae80065da1da9b3581602.pdb
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 2019.05.00", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !61)
!1 = !DIFile(filename: "DummyTransformColor.azslin.dx12.azslcout", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 69, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !10, !11, !40, !51, !54, !55, !56, !58, !59}
!7 = !DISubprogram(name: "??__Eo_textureColorSpaceId@@YAXXZ", scope: !1, file: !1, line: 69, type: !8, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!8 = !DISubroutineType(types: !9)
!9 = !{null}
!10 = !DISubprogram(name: "??__Eo_workingColorSpace@@YAXXZ", scope: !1, file: !1, line: 78, type: !8, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!11 = !DISubprogram(name: "MainPS", scope: !1, file: !1, line: 106, type: !12, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @MainPS)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !29}
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelOutput", file: !1, line: 92, size: 128, align: 32, elements: !15)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "m_color", scope: !14, file: !1, line: 94, baseType: !17, size: 128, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 78, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 78, size: 128, align: 32, elements: !19, templateParams: !25)
!19 = !{!20, !22, !23, !24}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 78, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 78, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 78, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !18, file: !1, line: 78, baseType: !21, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!25 = !{!26, !27}
!26 = !DITemplateTypeParameter(name: "element", type: !21)
!27 = !DITemplateValueParameter(name: "element_count", type: !28, value: i32 4)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOutput", file: !1, line: 86, size: 192, align: 32, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "m_position", scope: !29, file: !1, line: 88, baseType: !17, size: 128, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m_uv", scope: !29, file: !1, line: 89, baseType: !33, size: 64, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 78, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 78, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 78, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 78, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!26, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !28, value: i32 2)
!40 = !DISubprogram(name: "TransformColor", linkageName: "\01?TransformColor@@YA?AV?$vector@M$02@@V1@II@Z", scope: !1, file: !1, line: 22, type: !41, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !43, !4, !4}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 49, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 49, size: 96, align: 32, elements: !45, templateParams: !49)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !44, file: !1, line: 49, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !44, file: !1, line: 49, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !44, file: !1, line: 49, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!26, !50}
!50 = !DITemplateValueParameter(name: "element_count", type: !28, value: i32 3)
!51 = !DISubprogram(name: "srgb_to_linearsrgb", linkageName: "\01?srgb_to_linearsrgb@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 2, type: !52, isLocal: false, isDefinition: true, scopeLine: 3, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!43, !43}
!54 = !DISubprogram(name: "linearsrgb_to_acescg", linkageName: "\01?linearsrgb_to_acescg@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 7, type: !52, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubprogram(name: "AcesCgToAces2065", linkageName: "\01?AcesCgToAces2065@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 12, type: !52, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubprogram(name: "GetShaderVariantKey_o_textureColorSpaceId", linkageName: "\01?GetShaderVariantKey_o_textureColorSpaceId@@YAIXZ", scope: !1, file: !1, line: 117, type: !57, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !3)
!58 = !DISubprogram(name: "GetShaderVariantKey_o_workingColorSpace", linkageName: "\01?GetShaderVariantKey_o_workingColorSpace@@YAIXZ", scope: !1, file: !1, line: 124, type: !57, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubprogram(linkageName: "_GLOBAL__sub_I_DummyTransformColor.azslin.dx12.azslcout", scope: !1, file: !1, type: !60, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!60 = !DISubroutineType(types: !2)
!61 = !{!62, !64, !65, !66, !67, !68, !69, !70, !74, !76, !78, !80, !82}
!62 = !DIGlobalVariable(name: "o_textureColorSpaceId", scope: !0, file: !1, line: 69, type: !63, isLocal: true, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!64 = !DIGlobalVariable(name: "o_workingColorSpace", scope: !0, file: !1, line: 78, type: !63, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariable(name: "ColorSpaceId_Invalid", scope: !0, file: !1, line: 17, type: !63, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "ColorSpaceId_SRGB", scope: !0, file: !1, line: 18, type: !63, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "ColorSpaceId_LinearSRGB", scope: !0, file: !1, line: 19, type: !63, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariable(name: "ColorSpaceId_ACEScg", scope: !0, file: !1, line: 20, type: !63, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariable(name: "ColorSpaceId_ACES2065", scope: !0, file: !1, line: 21, type: !63, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariable(name: "MainSrg_m_texture", linkageName: "\01?MainSrg_m_texture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 47, type: !71, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?MainSrg_m_texture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 47, size: 160, align: 32, elements: !2, templateParams: !72)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "element", type: !18)
!74 = !DIGlobalVariable(name: "MainSrg_m_sampler", linkageName: "\01?MainSrg_m_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 49, type: !75, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?MainSrg_m_sampler@@3USamplerState@@A")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!76 = !DIGlobalVariable(name: "invalidColor", scope: !40, file: !1, line: 25, type: !77, isLocal: true, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!78 = !DIGlobalVariable(name: "invalidColor.0", linkageName: "\01?invalidColor@?1??TransformColor@@YA?AV?$vector@M$02@@V2@II@Z@4V2@B.0", scope: !40, file: !1, line: 25, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !77, size: 32, align: 4)
!80 = !DIGlobalVariable(name: "invalidColor.1", linkageName: "\01?invalidColor@?1??TransformColor@@YA?AV?$vector@M$02@@V2@II@Z@4V2@B.1", scope: !40, file: !1, line: 25, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !77, size: 32, align: 4, offset: 32)
!82 = !DIGlobalVariable(name: "invalidColor.2", linkageName: "\01?invalidColor@?1??TransformColor@@YA?AV?$vector@M$02@@V2@II@Z@4V2@B.2", scope: !40, file: !1, line: 25, type: !83, isLocal: false, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !77, size: 32, align: 4, offset: 64)
!84 = !{i32 2, !"Dwarf Version", i32 4}
!85 = !{i32 2, !"Debug Info Version", i32 3}
!86 = !{!"dxcoob 2019.05.00"}
